In [ ]:
# Contents: Inport libraries and dataset, data check, dropping column with PII and checking result, changing of data types,  
# checking for missed and mixed data types, Importing Data orders_products_merge2, checking result and data types, removal of 
# merge and eval set columns, Merging customer df with orders_products_merge2 df, export result.

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Importing Data
df = pd.read_csv(r'C:\Users\steph\OneDrive\Documents\May 2022 Instacart Basket Analysis\02 Data\Original Data\customers.csv', index_col = False)

In [3]:
# Checking data
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
df.drop(columns = ['First Name', 'Surnam', 'Gender'])

,user_id,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Missouri,48,1/1/2017,3,married,165665
1,33890,New Mexico,36,1/1/2017,0,single,59285
2,65803,Idaho,35,1/1/2017,2,married,99568
3,125935,Iowa,40,1/1/2017,0,single,42049
4,130797,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...
206204,168073,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Missouri,66,4/1/2020,2,married,53374
206207,81095,California,27,4/1/2020,1,married,99799
206208,80148,New York,55,4/1/2020,1,married,57095

In [5]:
df.value_counts(dropna = False)

user_id  First Name  Surnam    Gender  STATE          Age  date_joined  n_dependants  fam_status                        income
1        Linda       Nguyen    Female  Alabama        31   2/17/2019    3             married                           40423     1
137478   Elizabeth   Mcdonald  Female  Maryland       19   12/16/2019   2             living with parents and siblings  28625     1
137468   Todd        Welch     Male    Nevada         31   7/11/2017    1             married                           42533     1
137469   Douglas     Andrews   Male    New Hampshire  45   4/18/2018    1             married                           125718    1
137470   Jeremy      Bennett   Male    New Jersey     19   5/10/2019    3             living with parents and siblings  79969     1
                                                                                                                                 ..
68740    Michael     Wall      Male    Tennessee      48   8/18/2017    3             married                           134149    1
68741    Amy         Mack      Female  Texas          68   6/15/2017    0             divorced/widowed                  31977     1
68742    Victor      Guzman    Male    Utah           33   4/5/2019     0             single                            58471     1
68743    Stephen     Michael   Male    Vermont        70   7/28/2017    1             married                           80221     1
206209   Diana       Donovan   Female  Iowa           74   9/14/2019    3             married                           137969    1
Length: 206209, dtype: int64

In [6]:
# Defining new data set w/o unnecessary columns
df_cust = df.drop(columns = ['First Name', 'Surnam', 'Gender'])

In [7]:
# Checking new df
df_cust.head()

   user_id       STATE  Age date_joined  n_dependants fam_status  income
0    26711    Missouri   48    1/1/2017             3    married  165665
1    33890  New Mexico   36    1/1/2017             0     single   59285
2    65803       Idaho   35    1/1/2017             2    married   99568
3   125935        Iowa   40    1/1/2017             0     single   42049
4   130797    Maryland   26    1/1/2017             1    married   40374

In [8]:
df_cust['user_id'].value_counts(dropna = False)

26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: user_id, Length: 206209, dtype: int64

In [9]:
df_cust['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [10]:
df_cust['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [11]:
df_cust['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [13]:
# Data Consistency checks
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [26]:
# Checking and aligning df data types
df_cust.dtypes

user_id          int64
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [80]:
df_cust['fam_status'] = df_cust['fam_status'].astype('category')

In [81]:
df_cust['STATE'] = df_cust['STATE'].astype('category')

In [82]:
df_cust['date_joined'] = df_cust['date_joined'].astype('category')

In [90]:
df_cust.dtypes

user_id            int64
STATE           category
Age                int64
date_joined     category
n_dependants       int64
fam_status      category
income             int64
dtype: object

In [14]:
# Looking for mixed data columns
for col in df_cust.columns.tolist(): 
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1) 
    if len (df_cust[weird]) > 0: 
        print (col)

In [15]:
# Looking for missing data
df_cust.isnull().sum()

user_id         0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [16]:
# Looking for duplicate customer id rows
duplicateRows = df_cust[df_cust.duplicated(['user_id'])]

In [17]:
# Importing Data orders_products_merge2
orders_products_merge2 = pd.read_pickle(r'C:\Users\steph\OneDrive\Documents\May 2022 Instacart Basket Analysis\02 Data\Prepared Data\orders_products_merge2.pkl')

In [18]:
orders_products_merge2.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,...,department_id,prices,busiest_days,busiest_period_of_day,max_order,loyalty_flag,Spending,Spending_flag,Order_frequency,Frequency_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,7,9.0,Regularly Busy,Average Orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,7,9.0,Least Busy,Average Orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,7,9.0,Least Busy,Most Orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,7,9.0,Least Busy,Average Orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,7,9.0,Least Busy,Most Orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [19]:
# Comparing shape of both df
df_cust.shape

(206209, 7)

In [20]:
orders_products_merge2.shape

(32404859, 23)

In [42]:
# Checking data types in orders_products_merg2 df
orders_products_merge2.dtypes

order_id                     int32
user_id                      int32
eval_set                    object
order_number                  int8
orders_day_of_week            int8
time_of_order                 int8
days_since_prior_order     float32
product_id                   int32
add_to_cart_order            int16
reordered                     int8
_merge                    category
product_name                object
aisle_id                     int16
department_id                 int8
prices                     float32
busiest_days                object
busiest_period_of_day       object
max_order                     int8
loyalty_flag                object
Spending                   float32
Spending_flag               object
Order_frequency            float32
Frequency_flag              object
dtype: object

In [44]:
# Aligning data types in orders_products_merge 2
orders_products_merge2['eval_set'] = orders_products_merge2['eval_set'].astype(str)

In [74]:
orders_products_merge2['product_name'] = orders_products_merge2['product_name'].astype('category')

In [75]:
orders_products_merge2['busiest_days'] = orders_products_merge2['busiest_days'].astype('category')

In [76]:
orders_products_merge2['busiest_period_of_day'] = orders_products_merge2['busiest_period_of_day'].astype('category')

In [77]:
orders_products_merge2['loyalty_flag'] = orders_products_merge2['loyalty_flag'].astype('category')

In [72]:
orders_products_merge2['Frequency_flag'] = orders_products_merge2['Frequency_flag'].astype('category')

In [71]:
orders_products_merge2['Spending_flag'] = orders_products_merge2['Spending_flag'].astype('category')

In [62]:
orders_products_merge2['user_id'] = orders_products_merge2['user_id'].astype(int)

In [73]:
orders_products_merge2['busiest_days'] = orders_products_merge2['busiest_days'].astype('category')

In [86]:
orders_products_merge2['prices'] = orders_products_merge2['prices'].astype(int)

In [21]:
# Checking data type of user_id in orders_products_merg2 df
orders_products_merge2['user_id'].value_counts(dropna = False)

201268    3704
129928    3637
164055    3061
186704    2936
176478    2921
          ...
188345       3
70320        3
203875       2
124615       2
91567        1
Name: user_id, Length: 206209, dtype: int64

In [53]:
# removing column from previous merge as it isn't important to analysis
orders_products_merge2.drop('_merge', axis=1, inplace=True)

In [87]:
orders_products_merge2.dtypes

order_id                     int32
user_id                      int32
order_number                  int8
orders_day_of_week            int8
time_of_order                 int8
days_since_prior_order     float32
product_id                   int32
add_to_cart_order            int16
reordered                     int8
product_name              category
aisle_id                     int16
department_id                 int8
prices                       int32
busiest_days              category
busiest_period_of_day     category
max_order                     int8
loyalty_flag              category
Spending                   float32
Spending_flag             category
Order_frequency            float32
Frequency_flag            category
dtype: object

In [57]:
# removing column eval_set as it isn't important to analysis
orders_products_merge2.drop('eval_set', axis=1, inplace=True)

In [97]:
#Merging customer df with orders_products_merge2 df
cust_prods_merged = orders_products_merge2.merge(df_cust, on = 'user_id', indicator = True)

In [98]:
# Checking newly merged df
cust_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,Spending_flag,Order_frequency,Frequency_flag,STATE,Age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Low spender,20.5,Non-frequent customer,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Low spender,20.5,Non-frequent customer,Alabama,31,2/17/2019,3,married,40423,both

In [99]:
cust_prods_merged.to_pickle(r'C:\Users\steph\OneDrive\Documents\May 2022 Instacart Basket Analysis\02 Data\Prepared Data\cust_prods_merged (4.9 pt1).pkl')